Revit 2027 API
PipeFittingAndAccessoryData.FluidDensity Property
 The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FluidDensity { get; }
Public ReadOnly Property FluidDensity As Double
	Get
public:
property double FluidDensity {
	double get ();
}
member FluidDensity : float with get
Property Value
Double
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace